{
    "home": {
      "title": "Karim Ghazal Pando",
      "subtitle": "Explorant el big data i el desenvolupament web",
      "description": "Amb una àmplia experiència en el sector de la construcció, he decidit en els darrers anys diversificar el meu perfil professional aventurant-me en el camp del desenvolupament web, l'anàlisi de dades i el machine learning, explorant l'ús de diferents eines i biblioteques. El meu objectiu és aplicar aquests coneixements tant en arquitectura com en altres sectors dinàmics, per tal de contribuir amb solucions més eficients i mantenir-me actualitzat en la transformació digital."
    },
    "projects": {
      "title": "Projectes",
      "subtitle": "Alguns projectes personals amb l'objectiu principal d'explorar i continuar aprenent sobre desenvolupament web i noves eines.",
      "findPointTitle": "FindPoint",
      "findPointDescription": "Dissenyada i desenvolupada per mi, l'aplicació permet als usuaris descobrir punts d'interès en funció de la ciutat en la qual es troben, utilitzant recomanacions compartides per altres usuaris. Amb una interfície intuïtiva i centrada en la ubicació, l'aplicació suggereix llocs destacats, ja sigui per a turistes o per a locals que busquin explorar. A més, registrant-se, els usuaris desbloquegen funcions addicionals com afegir nous punts d'interès i valorar els existents, fomentant una comunitat col·laborativa que enriqueix les experiències locals i promou l'intercanvi d'informació valuosa. L'aplicació ha estat desenvolupada íntegrament en Python, un llenguatge tradicionalment utilitzat per al desenvolupament backend. No obstant això, amb tecnologies com Flask, podem adaptar gairebé tot el frontend utilitzant Python pur. L'objectiu era simplement crear una aplicació amb bona funcionalitat i aparença. Tot i que utilitzar Python per al frontend pot causar alguns problemes de rendiment, per a aplicacions petites que requereixen pocs recursos, pot ser una bona opció a causa de la facilitat de desenvolupament que ofereix Python.",
      "normasTitle": "normIA",
      "normasDescription": "Una eina enfocada a ajudar a la recerca de regulacions mitjançant l'aplicació d'intel·ligència artificial (desactivada pendent de renovació de l'apikey d'OpenAI). El seu objectiu és facilitar la interpretació de la normativa al sector de la construcció, proporcionant una experiència eficient i pràctica.",
      "bpfTitle": "Projecte BPF en construcció",
      "bpfDescription": "Aquesta aplicació també ha estat dissenyada i desenvolupada per mi. És una eina creada per a ajudar amb les reparacions de la llar. Haurem d'esperar una mica fins que estigui acabada per a descobrir de tot del que es tracta. L'aplicació s'està desenvolupant utilitzant el stack MERN. El llenguatge principal és JavaScript, tant en el frontend com en el backend i atès que l'aplicació necessita emmagatzemar dades relacionals, així com altres tipus de dades que no s'ajusten a un model relacional estricte, es va triar MongoDB, una base de dades NoSQL.",
      "worldHappinessTitle": "Índex Mundial de Felicitat",
      "worldHappinessDescription": "L'Índex Mundial de Felicitat es mesura a través de diferents paràmetres que, sumats, donen una puntuació a cada país. Aquest exercici recull, neteja i transforma les dades per crear gràfics representatius de cada regió, facilitant la seva comprensió i visualització mitjançant un globus interactiu. L'objectiu d'aquest treball no és contrastar la veracitat de l'origen de les dades, sinó la transformació, interpretació i representació d'aquestes.",
      "worldPlasticTitle": "Producció i contaminació mundial de plàstic",
      "worldPlasticDescription": "Aquest estudi analitza la quantitat de plàstic produït anualment i com es gestiona la seva eliminació a nivell global. S'estudien regions industrialitzades per entendre la gestió del reciclatge i la incineració de residus plàstics. L'objectiu d'aquest treball no és contrastar la veracitat de l'origen de les dades, sinó la transformació, interpretació i representació d'aquestes.",
      "primeTitle": "Dades de Prime Video",
      "primeDescription": "Aquest conjunt de dades d'Amazon Prime Video inclou una llista detallada de totes les pel·lícules i sèries disponibles a la plataforma, amb informació sobre directors, repartiment, any de llançament, classificació i altres detalls. Es pot analitzar l'evolució dels continguts al llarg dels anys per identificar tendències, com l'augment de la producció de sèries enfront de pel·lícules en els últims temps. L'objectiu d'aquest treball no és contrastar la veracitat de l'origen de les dades, sinó la transformació, interpretació i representació d'aquestes.",
      "polynomialRegressionTitle": "Regressió Polinòmica",
      "polynomialRegressionDescription": "Aquest cas se centra en la regressió polinòmica. S'han importat les biblioteques numpy per a càlculs numèrics, matplotlib.pyplot per crear gràfics i visualitzar dades, i pandas per a la manipulació i anàlisi de dades. En aquest cas d'estudi sobre la relació entre posició i salari, la regressió polinòmica captura la relació no lineal entre les variables, a diferència de la regressió lineal, que es desvia de molts punts i no permet una predicció precisa d'un sou en funció de la posició.",
      "hierarchicalClusteringTitle": "Agrupament Jeràrquic",
      "hierarchicalClusteringDescription": "Aquest cas se centra en l'anàlisi de clustering jeràrquic, on pretenem dividir diferents perfils de persones en grups homogenis a partir de les seves dades per tal d'orientar els esforços en funció del seu potencial de compra. Atès que els recursos en publicitat, etc. són limitats, pretenem ser més eficients a l'hora d'invertir temps/diners en clients potencials. En aquest cas, també es va utilitzar la biblioteca scikit-learn per obtenir el clustering."
    },
    "data": {
      "title": "Dades",
      "subtitle": "Alguns exemples d'exercicis i petits projectes sobre análisis i ciència de dades que he anat realitzant en diferents cursos."
    },
    "contact": {
      "sendEmail": "Enviar un correu"
    }
  }
  
