{
    "home": {
      "title": "Karim Ghazal Pando",
      "subtitle": "Explorando el big data y el desarrollo web",
      "description": "Con una amplia experiencia en el sector de la construcción, he decidido en los últimos años diversificar mi perfil profesional aventurándome en el campo del desarrollo web, el análisis de datos y el machine learning, explorando el uso de diferentes herramientas y bibliotecas. Mi objetivo es aplicar estos conocimientos tanto en arquitectura como en otros sectores dinámicos, con el fin de contribuir con soluciones más eficientes y mantenerme actualizado en la transformación digital."
    },
    "projects": {
      "title": "Proyectos",
      "subtitle": "Algunos proyectos personales con el principal objetivo de explorar y seguir aprendiendo sobre desarrollo web y nuevas herramientas.",
      "findPointTitle": "FindPoint",
      "findPointDescription": "Diseñada y desarrollada por mí, la aplicación permite a los usuarios descubrir puntos de interés en función de la ciudad en la que se encuentren, utilizando recomendaciones compartidas por otros. Con una interfaz intuitiva y centrada en la ubicación, la aplicación sugiere lugares destacados, ya sea para turistas o para locales que buscan explorar. Además, al registrarse, los usuarios desbloquean funciones adicionales como añadir nuevos puntos de interés y calificar los existentes, fomentando una comunidad colaborativa que enriquece las experiencias locales y promueve el intercambio de información valiosa. La aplicación ha sido desarrollada íntegramente en Python, un lenguaje tradicionalmente utilizado para el desarrollo backend. Sin embargo, con tecnologías como Flask, podemos adaptar casi todo el frontend utilizando Python puro. El objetivo era simplemente crear una aplicación con buena funcionalidad y apariencia. Aunque usar Python para el frontend puede causar algunos problemas de rendimiento, para aplicaciones pequeñas que requieren pocos recursos, puede ser una buena opción debido a la facilidad de desarrollo que ofrece Python.",
      "normasTitle": "normIA",
      "normasDescription": "Un proyecto enfocado en ayudar en la búsqueda de regulaciones mediante la aplicación de inteligencia artificial. Su objetivo es facilitar la interpretación de la normativa en el sector de la construcción, proporcionando una experiencia eficiente y práctica. En este momento la aplicación no está operativa porque necesita un plan de actualización OpenAI que permita la conexión con la clave.",
      "bpfTitle": "Proyecto BPF en construcción",
      "bpfDescription": "Esta aplicación también ha sido diseñada y desarrollada por mí. Es una herramienta creada para ayudar con las reparaciones del hogar. Tendremos que esperar un poco hasta que esté terminado para descubrir del todo de qué se trata. La aplicación se está desarrollando utilizando el stack MERN. El lenguaje principal es JavaScript, tanto en el frontend como en el backend y dado que la aplicación necesita almacenar datos relacionales, así como otros tipos de datos que no se ajustan a un modelo relacional estricto, se eligió MongoDB, una base de datos NoSQL.",
      "worldHappinessTitle": "Índice Mundial de Felicidad",
      "worldHappinessDescription": "El Índice Mundial de Felicidad se mide a través de diferentes parámetros que, sumados, otorgan una puntuación a cada país. Este ejercicio recoge, limpia y transforma los datos para crear gráficos representativos de cada región, facilitando su comprensión y visualización mediante un globo interactivo. El objetivo de este trabajo no es contrastar la veracidad del origen de los datos, sino la transformación, interpretación y representación de estos.",
      "worldPlasticTitle": "Producción y contaminación mundial de plástico",
      "worldPlasticDescription": "Este estudio analiza cuánto plástico se produce anualmente y cómo se gestiona su eliminación a nivel global. Se estudian regiones industrializadas para entender su manejo del reciclaje e incineración de residuos plásticos. El objetivo de este trabajo no es contrastar la veracidad del origen de los datos, sino la transformación, interpretación y representación de estos.",
      "primeTitle": "Datos de Prime Video",
      "primeDescription": "Este conjunto de datos de Amazon Prime Video incluye una lista detallada de todas las películas y series disponibles en la plataforma, con información sobre directores, reparto, año de lanzamiento, clasificación, entre otros detalles. Se analiza la evolución de los contenidos a lo largo de los años para identificar tendencias, como el aumento en la producción de series frente a películas en los últimos tiempos. El objetivo de este trabajo no es contrastar la veracidad del origen de los datos, sino la transformación, interpretación y representación de estos.",
      "polynomialRegressionTitle": "Regresión Polinomial",
      "polynomialRegressionDescription": "Este caso se centra en la regresión polinómica. Se han importado las bibliotecas numpy para cálculos numéricos, matplotlib.pyplot para crear gráficos y visualizar datos, y pandas para manipulación y análisis de datos. En este estudio de caso sobre la relación entre puesto y salario, la regresión polinómica captura la relación no lineal entre las variables, a diferencia de la regresión lineal, que se desvía de muchos puntos y no permite una predicción precisa de un salario basado en el puesto.",
      "hierarchicalClusteringTitle": "Agrupamiento Jerárquico",
      "hierarchicalClusteringDescription": "Este caso se centra en el análisis de agrupamiento jerárquico, donde pretendemos dividir diferentes perfiles de personas en grupos homogéneos en función de sus datos para orientar los esfuerzos de acuerdo con su potencial de compra. Dado que los recursos en publicidad, etc. son limitados, pretendemos ser más eficientes a la hora de invertir tiempo/dinero en clientes potenciales. En este caso, también se utilizó la biblioteca scikit-learn para obtener el agrupamiento."
    },
    "data": {
      "title": "Datos",
      "subtitle": "Algunos ejemplos de ejercicios y pequeños proyectos sobre análisis y ciencia de datos que he estado realizando en diferentes cursos."
    },
    "contact": {
      "title": "Contacto"
    }
  }
  